Revit 2024 API
ShapeImporter.IsServiceAvailable Method
 Checks whether the data conversion service is available.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public static bool IsServiceAvailable()
Visual Basic
Public Shared Function IsServiceAvailable As Boolean
Visual C++
public:
static bool IsServiceAvailable()
Return Value
 True if the data conversion service is available, false otherwise.
Remarks
 ShapeImporter relies on optional data conversion functionality. This function checks whether it is available.
See Also
ShapeImporter Class
Autodesk.Revit.DB Namespace